// 題庫
const TAXONOMY = {
  "原核生物界": {
    "細菌": ["肺炎鏈球菌","金黃色葡萄球菌","乳酸桿菌","乳酸菌","大腸桿菌","結核桿菌","肺結核","傷寒桿菌","霍亂弧菌","鉤端螺旋菌","根瘤菌","梅毒螺旋體"],
    "藍綠菌": ["念珠藻","顫藻","鞘絲藻","色球藻","藍球藻","藍鼓藻","螺旋藻","藍綠藻","髮菜(髮狀念珠藻)","雨來菇/葛仙米藻(念珠藻)","藍菌"]
  },
  "原生生物界": {
    "藻類": ["矽藻","新月藻","單胞藻","水綿","石蓴","巨藻","昆布","海帶","馬尾藻","紫菜","石花菜"],
    "原生菌類": ["黏菌","水黴菌"],
    "原生動物": ["草履蟲","變形蟲","綠眼蟲","瘧原蟲","瘧疾","推體蟲","眼蟲","睡眠病"]
  },
  "真菌界": {
    "多細胞": {
      "黴菌": ["青黴菌","黑黴菌","香港腳","足癬","灰指甲"],
      "蕈類": ["香菇","竹蓀","木耳","靈芝","冬蟲夏草","牛樟芝","紅托鵝膏"],
      "其他": ["黃麴菌"]
    },
    "單細胞": ["酵母菌"]
  },
  "植物界": {
    "蘚苔植物": ["地錢","土馬騌"],
    "蕨類植物": ["筆筒樹","山蘇","鳥巢蕨(山蘇)","台灣水韭","腎蕨","鐵線蕨","過溝菜蕨"],
    "裸子植物": ["松","杉","柏","紅檜","蘇鐵","銀杏","龍柏","二葉松","台灣杉"],
    "被子植物": {
      "單子葉": ["水稻","小麥","玉米","甘蔗","竹子","椰子樹","百合","蘭花","蔥","箭竹"],
      "雙子葉": ["榕樹","菩提","朱槿","草莓","芥菜","落地生根","杜鵑","天竺葵","油桐","梅花","櫻花","牽牛花","仙人掌","水筆仔","捕蠅草"]
    }
  },
  "動物界": {
    "無脊索動物": {
      "刺絲胞動物門": ["珊瑚","海葵","水母","水螅"],
      "扁形動物門": ["渦蟲","吸蟲","絛蟲"],
      "軟體動物門": {
        "斧足綱": ["文蛤","牡蠣","扇貝"],
        "腹足綱": ["蝸牛","蛞蝓","海兔","福壽螺"],
        "頭足綱": ["烏賊","章魚","鸚鵡螺"]
      },
      "環節動物門": ["水蛭","蚯蚓","沙蠶"],
      "節肢動物門": {
        "甲殼綱": ["蝦子","螃蟹","龍蝦","毛蟹"],
        "蛛形綱": ["蜘蛛","蠍子","塵蟎"],
        "昆蟲綱": ["蝴蝶","蜻蜓","蚊子","蒼蠅","跳蚤","衣魚","糞金龜"],
        "其他綱": ["蜈蚣","馬陸","鱟(活化石)"]
      },
      "棘皮動物門": ["海星","海參","海膽","陽燧足","海百合"]
    },
    "脊索動物": {
      "魚類": {
        "軟骨魚": ["鯊魚","魟魚"],
        "硬骨魚": ["海馬","彈塗魚"]
      },
      "兩生類": ["山椒魚","青蛙","蟾蜍","蠑螈"],
      "爬蟲類": ["蛇","蜥蜴","龜","鱷魚","壁虎","南蛇","變色龍","斑龜"],
      "鳥類": ["企鵝","鴕鳥","白頭翁","貓頭鷹","鴿子"],
      "哺乳類": {
        "單孔(卵生)": ["鴨嘴獸","針鼴"],
        "有袋(胎生)": ["袋鼠","無尾熊"],
        "胎盤(胎生)": ["穿山甲","鯨魚","海豚","蝙蝠","人類","海牛"]
      }
    }
  },
  "病毒": ["登革熱","新冠肺炎","愛滋病","流行性感冒"]
};

// 考卷
const EXAM_PAPERS = {
  "【俊卷-第一大題】原核～真菌": ["青黴菌", "草履蟲", "大腸桿菌", "竹蓀", "顫藻", "酵母菌", "乳酸菌", "黏菌", "木耳", "黑黴菌", "藍菌", "石蓴", "眼蟲", "水黴菌", "昆布", "變形蟲", "牛樟芝", "黃麴菌", "水綿", "冬蟲夏草", "新月藻", "根瘤菌", "梅毒螺旋體", "紅托鵝膏", "紫菜", "髮菜(髮狀念珠藻)", "石花菜", "肺炎鏈球菌"],
  "【俊卷-第二大題】疾病": ["足癬", "肺結核", "登革熱", "新冠肺炎", "愛滋病", "瘧疾", "睡眠病", "流行性感冒", "灰指甲"],
  "【俊卷-第三大題】植物界": ["箭竹", "仙人掌", "台灣水韭", "地錢", "二葉松", "捕蠅草", "蘇鐵", "山蘇", "台灣杉", "土馬騌", "紅檜", "銀杏", "筆筒樹", "龍柏", "水筆仔"],
  "【俊卷-第四大題】動物界": ["扇貝", "海膽", "龍蝦", "水螅", "珊瑚", "絛蟲", "蝸牛", "企鵝", "塵蟎", "文蛤", "糞金龜", "斑龜", "無尾熊", "魟魚", "南蛇", "烏賊", "蜘蛛", "海葵", "渦蟲", "毛蟹", "海星", "鴨嘴獸", "衣魚", "鯨魚", "鯊魚", "山椒魚", "海兔", "海馬", "海牛", "海豚", "水母", "壁虎", "鱷魚", "馬陸", "針鼴", "袋鼠", "變色龍", "蚯蚓", "水蛭", "蝙蝠", "海參", "彈塗魚", "穿山甲", "牡蠣", "吸蟲", "蜈蚣", "福壽螺", "蠑螈"],
  "【俊卷】錯題": ["水螅", "壁虎", "鉤端螺旋菌", "冬蟲夏草", "銀杏"],

};
